//задание 1
let tc = Number(prompt('Введите температуру по Цельсию'))
let tf = alert('Температура по фарингейту = ' + ( (9/5) * tc + 32 ) )

//задание 2
let name = 'Василий'
let admin = name 
console.log(admin)


//задание 3
console.log(1000 + '108') 
/*вывод - 1000108, т.к. при сложении числа и строки js переводит число в строку и совершает конкатенацию, 
отдавая строчный тип

/*задание 4
async - асинхронное выполение. Скрипт начнет выполнения не ожидая того, когда загрузится страница. 
defer - откладывает выполнения скрипта до тех пор, пока страница не будет загружена
*/
